#include <stdio.h>
#define WEIGHT 60
#define HEIGHT 1.8
int main()
{
	float bmi;
	bmi = WEIGHT / (HEIGHT * HEIGHT);
	printf("身高是%.2f\n体重是%d\nBMI值是%.2f", HEIGHT, WEIGHT, bmi);
	return 0;
}

/*

                    _oo0oo_
                   o8888888o
                   88" . "88
                   (| -_- |)
                   0\ = / 0
                 ___ / `---'\___
               .' \\|     |// '.
              / \\|||  :  |||// \
             / _||||| -:- |||||- \
            |   | \\\  -  /// |   |
            | \_|  ''\---/''  |_/ |
            \  .-\__  '-'  ___/-. /
          ___'. .' / --.--\  `. .'___
       ."" '<  `.___\_<|>_/___.' >' "".
      | | :  `- \`.;`\ _ /`;.`/ - ` : | |
      \  \ `_.   \_ __\ /__ _/   .-` /  /
 =====`-.____`.___ \_____/___.-`___.-'=====
                    `=---='
            佛祖保佑       永无BUG
    我曰：
           写字楼里写字间，写字间里程序员。
           程序人员写程序，又拿程序换酒钱。
           酒醒只在网上坐。酒醒还来网下眠。
           酒醉酒醒日复日，网上网下年复年。
           但愿老死电脑间，不愿鞠躬老板前。
           奔驰宝马贵者趣，公交自行程序员。
           别人笑我忒疯癫，我笑自己命太贱：
           不见满街漂亮妹，哪个归得程序员？
    佛曰：
                   《码海慈航》
           金盘托起菩提光，玉键敲出般若香。
           万行代码皆禅意，亿重逻辑尽慈航。
           需求变更如云过，bug化尘随风扬。
           但得此心无挂碍，佛祖佑汝程序昌。
*/